// Напишите программу, которая принимает на вход пятизначное число 
// и проверяет, является ли оно палиндромом. Через строку решать нельзя.

// Console.WriteLine("Введите пятизначное число");
// int num = Convert.ToInt32(Console.ReadLine());
// int num1 = num / 10000;
// int num2 = num % 10;
// int num3 = num / 1000 % 10;
// int num4 = num / 10 % 10;
// if (num1 == num2 && num3 == num4)
//     Console.WriteLine("Это палиндром");
// else 
//     Console.WriteLine("Это не палиндром");

// Напишите программу, которая принимает на вход координаты двух точек 
// и находит расстояние между ними в 3D пространстве.